# =========================================================
# Development
# =========================================================

# Utils/Build Tools
brew 'autoconf'
brew 'automake'
brew 'gawk'
brew 'gpg'
brew 'openssl'
brew 'pcre'
brew 'readline'
brew 'xz'

# Dev Tools
brew 'asdf'
brew 'fzf'
brew 'git'
brew 'neovim'
brew 'ripgrep'
brew 'tree'
brew 'zsh'

# Libraries
brew 'bcrypt'
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# =========================================================
# Applications
# =========================================================
cask '1password'
cask 'alfred'
cask 'dash'
cask 'firefox'
cask 'google-chrome'
cask 'kitty'
cask 'paw'
cask 'rectangle'
cask 'slack'
cask 'sublime-text'
