# =========================================================
# Development
# =========================================================

# Utils/build tools
brew 'autoconf'
brew 'automake'
brew 'pcre'
brew 'readline'
brew 'xz'

# Dev tools
brew 'fzf'
brew 'git'
brew 'hub'
brew 'neovim/neovim/neovim'
system 'pip3 install neovim'
brew 'ripgrep'
brew 'tree'
brew 'vimpager'
brew 'zsh'

# Libraries
brew 'bcrypt'
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# Languages
brew 'node-build'
brew 'nodenv'
brew 'python3'
brew 'rbenv'
brew 'ruby-build'
brew 'yarn'

# Databases
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'

# Fun
brew 'irssi'

# =========================================================
# Applications
# =========================================================
cask '1password'
cask 'alfred'
cask 'dash'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'paw'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
