# =========================================================
# Customization
# =========================================================
# Quicklook extensions
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'webpquicklook'

# =========================================================
# Development
# =========================================================

# Utils/Build tools
# Not sure how many of these I actually need
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'makedepend'
brew 'pcre'
brew 'wget'
brew 'xz'

# Dev tools
brew 'ctags'
brew 'docker'
brew 'docker-machine'
brew 'fzf'
brew 'git-crypt'
brew 'heroku'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'neovim/neovim/neovim'
system 'pip3 install neovim'
brew 'p7zip'
brew 'ripgrep'
brew 'the_silver_searcher'
brew 'tree'
brew 'watchman'
brew 'vimpager'
brew 'yarn'

# Libraries
brew 'imagemagick', args: ['with-libtiff', 'with-little-cms', 'with-ghostscript']

# Languages
brew 'crystal-lang'
brew 'elixir'
brew 'go'
brew 'llvm'
brew 'node'
brew 'nvm'
brew 'python3'
brew 'rbenv'
brew 'ruby-build'
brew 'rust'

# Databases
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'

# Other webdev tools
brew 'elasticsearch'
brew 'logstash'

# Fun
brew 'exercism'

# =========================================================
# Applications
# =========================================================
cask 'alfred'
cask 'bartender'
cask 'cloud'
cask 'dash'
cask 'dashlane'
cask 'dockertoolbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'keepingyouawake'
cask 'paw'
cask 'slack'
cask 'spotify'
cask 'transmit'
cask 'virtualbox'
cask 'vivaldi'

mas 'DaisyDisk', id: 411643860
mas 'Fantastical', id: 975937182
mas 'Magnet', id: 441258766
mas 'The Archive Browser', id: 510232205
mas 'The Unarchiver', id: 425424353
